NextFOAM-2407/tutorials/heatTransfer/chtMultiRegionSimpleFoam/multiRegionHeaterRadiation/Allrun-parallel
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

# Setup case
./Allrun.pre

#-- Run in parallel

# Decompose
runApplication decomposePar -allRegions

# Agglomerate patch faces
#for region in bottomAir topAir
#do
#    runParallel -s "$region" \
#        faceAgglomerate -region "$region" -dict constant/viewFactorsDict
#done

# Generate view factors
for region in bottomAir topAir
do
    runParallel -s "$region" \
        viewFactorsGen -region "$region"
done

# Run
runParallel $(getApplication)

runParallel foamToEnsight -allRegions

# Reconstruct
runApplication reconstructPar -allRegions

#------------------------------------------------------------------------------
